DataProcessors/ПланированиеЗагрузкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПланированиеЗагрузкиСотрудников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаОказана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПланированиеЗагрузкиСотрудников/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Назад(Команда)
	УстановитьПредставлениеПериода("Назад");
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	УстановитьПредставлениеПериода("Сегодня");
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	УстановитьПредставлениеПериода("Вперед");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланировщикНаСервере(ДатаНачалаОтрисовки, ДатаОкончанияОтрисовки)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ЗаписьКлиента.Сотрудник КАК Сотрудник,
	|	ЗаписьКлиента.Сотрудник.Представление КАК СотрудникПредставление,
	|	ЗаписьКлиента.ДатаЗаписи КАК ДатаЗаписи,
	|	ЗаписьКлиента.ДатаОкончанияЗаписи КАК ДатаОкончанияЗаписи,
	|	ЗаписьКлиента.Клиент.Представление КАК КлиентПредставление,
	|	ЗаписьКлиента.Ссылка КАК ЗаписьКлиента,
	|	ЗаписьКлиента.УслугаОказана КАК УслугаОказана
	|ИЗ
	|	Документ.ЗаписьКлиента КАК ЗаписьКлиента
	|ГДЕ
	|	ЗаписьКлиента.Проведен
	|	И ЗаписьКлиента.ДатаЗаписи МЕЖДУ &Начало И &Окончание
	|ИТОГИ ПО
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("Начало",ДатаНачалаОтрисовки);
	Запрос.УстановитьПараметр("Окончание",ДатаОкончанияОтрисовки);
	
	
	ИзмеренияПланировщика = Планировщик.Измерения;
	ИзмеренияПланировщика.Очистить();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСотрудники = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ИзмерениеСотрудники = ИзмеренияПланировщика.Добавить("Сотрудники");
	
	Планировщик.Элементы.Очистить();
	
	Пока ВыборкаСотрудники.Следующий() Цикл
		
		
		НовоеИзмерение = ИзмерениеСотрудники.Элементы.Добавить(ВыборкаСотрудники.Сотрудник);
		НовоеИзмерение.Текст = ВыборкаСотрудники.СотрудникПредставление;
		
		Выборка = ВыборкаСотрудники.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДатаНачала = Выборка.ДатаЗаписи;
			ДатаОкончания = Выборка.ДатаОкончанияЗаписи;
			
			СоответствиеЗначений = Новый Соответствие;
			СоответствиеЗначений.Вставить("Сотрудники",Выборка.Сотрудник);
			
			НовыйЭлемент = Планировщик.Элементы.Добавить(ДатаНачала, ДатаОкончания);
			НовыйЭлемент.Текст = СокрЛП(Выборка.КлиентПредставление);
			НовыйЭлемент.Значение = Выборка.ЗаписьКлиента;
			Если Выборка.УслугаОказана Тогда
				НовыйЭлемент.ЦветФона  = Новый Цвет(255, 153, 0);
			Иначе
				НовыйЭлемент.ЦветФона  = Новый Цвет(255, 237, 175);
			КонецЕсли;
			НовыйЭлемент.ЦветРамки = WebЦвета.Черный;
			НовыйЭлемент.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредставлениеПериода(Вариант = Неопределено)
	
	ДатаНачалаОтрисовки = НачалоДня(ТекущаяДата());
	ДатаНачалаОтрисовки = КонецДня(ТекущаяДата());
	
	ТекущийПериод = Планировщик.ТекущиеПериодыОтображения[0];
	Если НЕ ЗначениеЗаполнено(ТекущийПериод.Начало) Тогда
		ТекущийПериод.Начало = ТекущаяДата();
	КонецЕсли;
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Если Период = "День" Тогда
		
		Если Вариант = Неопределено Тогда
			ДатаНачалаОтрисовки = НачалоДня(ТекущийПериод.Начало);
		ИначеЕсли Вариант = "Назад" Тогда
			ДатаНачалаОтрисовки = НачалоДня(ТекущийПериод.Начало) - 60 * 60 * 24;
		ИначеЕсли Вариант = "Вперед" Тогда
			ДатаНачалаОтрисовки = НачалоДня(ТекущийПериод.Начало) + 60 * 60 * 24;
		ИначеЕсли Вариант = "Сегодня" Тогда
			ДатаНачалаОтрисовки = НачалоДня(ТекущаяДата());
		КонецЕсли;
		
		ДатаОкончанияОтрисовки  = КонецДня(ДатаНачалаОтрисовки);
		Планировщик.ТекущиеПериодыОтображения.Добавить(ДатаНачалаОтрисовки, ДатаОкончанияОтрисовки); 
		ПредставлениеПериода = Формат(ДатаНачалаОтрисовки, "ДФ='дд ММММ'");
		
		
	ИначеЕсли Период = "Неделя" Тогда
		
		Если Вариант = Неопределено Тогда
			ДатаНачалаОтрисовки = НачалоНедели(ТекущийПериод.Начало);
		ИначеЕсли Вариант = "Назад" Тогда
			ДатаНачалаОтрисовки = НачалоНедели(ТекущийПериод.Начало) - 7 * 60 * 60 * 24;
		ИначеЕсли Вариант = "Вперед" Тогда
			ДатаНачалаОтрисовки = НачалоНедели(ТекущийПериод.Начало) + 7 * 60 * 60 * 24;
		ИначеЕсли Вариант = "Сегодня" Тогда
			ДатаНачалаОтрисовки = НачалоНедели(ТекущаяДата());
		КонецЕсли;
		
		ДатаОкончанияОтрисовки  = КонецНедели(ДатаНачалаОтрисовки);
		Планировщик.ТекущиеПериодыОтображения.Добавить(ДатаНачалаОтрисовки, ДатаОкончанияОтрисовки);
		ПредставлениеПериода = СтрШаблон("%1 - %2", Формат(ДатаНачалаОтрисовки, "ДФ='дд ММММ'"), Формат(ДатаОкончанияОтрисовки, "ДФ='дд ММММ гггг'"));
		
	ИначеЕсли Период = "Месяц" Тогда
		
		Если Вариант = Неопределено Тогда
			ДатаНачалаОтрисовки = НачалоМесяца(ТекущийПериод.Начало);
		ИначеЕсли Вариант = "Назад" Тогда
			ДатаНачалаОтрисовки = ДобавитьМесяц(ТекущийПериод.Начало, -1);
		ИначеЕсли Вариант = "Вперед" Тогда
			ДатаНачалаОтрисовки = ДобавитьМесяц(ТекущийПериод.Начало, 1);
		ИначеЕсли Вариант = "Сегодня" Тогда
			ДатаНачалаОтрисовки = НачалоМесяца(ТекущаяДата());
		КонецЕсли;
		
		ДатаОкончанияОтрисовки  = КонецМесяца(ДатаНачалаОтрисовки);
		Планировщик.ТекущиеПериодыОтображения.Добавить(ДатаНачалаОтрисовки, ДатаОкончанияОтрисовки);
		ПредставлениеПериода = ПредставлениеПериода(ДатаНачалаОтрисовки, ДатаОкончанияОтрисовки);
		
	КонецЕсли;
	ЗаполнитьПланировщикНаСервере(ДатаНачалаОтрисовки, ДатаОкончанияОтрисовки)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПланировщикНаСервере(,);
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = "День";
	КонецЕсли;
	УстановитьОтображениеПланировщика();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеПланировщика()
	
	НачалоРабочегоДня = Константы.НачалоРабочегоДня.Получить();
	КонецРабочегоДня =  Константы.КонецРабочегоДня.Получить();
	
	Планировщик.ОтображатьТекущуюДату = Истина;
	Планировщик.ОтступСНачалаПереносаШкалыВремени = НачалоРабочегоДня;
	Планировщик.ОтступСКонцаПереносаШкалыВремени = ?(КонецРабочегоДня = 0, 0, 24 - КонецРабочегоДня);
	Планировщик.ЕдиницаПериодическогоВарианта   = ТипЕдиницыШкалыВремени.Час;
	Планировщик.КратностьПериодическогоВарианта = 24;
	Планировщик.ВыравниватьГраницыЭлементовПоШкалеВремени = Ложь;
	Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='дддд, д ММММ гггг'";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтображениеПланировщика();
	УстановитьПредставлениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьПредставлениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытияФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	ОткрытьФорму("Документ.ЗаписьКлиента.Форма.ФормаДокумента", ПараметрыОткрытияФормы,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытияФормы = Новый Структура("Начало, Окончание, Сотрудник", Начало, Конец, ЗначенияИзмерений.Получить("Сотрудники"));
	ОткрытьФорму("Документ.ЗаписьКлиента.Форма.ФормаДокумента",ПараметрыОткрытияФормы,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Записан заказ" Тогда
	Планировщик.Элементы.Очистить();
	ЗаполнитьПланировщикНаСервере(,);
КонецЕсли;
КонецПроцедуры
